Revit 2027 API
ExternalService.GetOptions Method
 A copy of the options the service was registered with.
Namespace: Autodesk.Revit.DB.ExternalService
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ExternalServiceOptions GetOptions()
Public Function GetOptions As ExternalServiceOptions
public:
ExternalServiceOptions^ GetOptions()
member GetOptions : unit -> ExternalServiceOptions
Return Value
ExternalServiceOptions
 An instance of the options class.
Remarks
 The returned instance is mutable, but any changes made there cannot be assigned back to the service.
See Also
Reference
ExternalService Class
Autodesk.Revit.DB.ExternalService Namespace